In [1]:
import pandas as pd
import numpy as np

In [2]:
# Load raw data
df_products = pd.read_csv(
    "C:/Users/User/Desktop/dashboard/PROJECTS_NOT_ON_GITHUB/Retail/data/raw/products.csv"
)

df_carts = pd.read_csv(
    "C:/Users/User/Desktop/dashboard/PROJECTS_NOT_ON_GITHUB/Retail/data/raw/carts.csv"
)

df_users = pd.read_csv(
    "C:/Users/User/Desktop/dashboard/PROJECTS_NOT_ON_GITHUB/Retail/data/raw/users.csv"
)

In [3]:
df_products.head()

,product_id,product_name,category,brand,price,rating,discountPercentage
0,1,Essence Mascara Lash Princess,beauty,Essence,9.99,2.56,10.48
1,2,Eyeshadow Palette with Mirror,beauty,Glamour Beauty,19.99,2.86,18.19
2,3,Powder Canister,beauty,Velvet Touch,14.99,4.64,9.84
3,4,Red Lipstick,beauty,Chic Cosmetics,12.99,4.36,12.16
4,5,Red Nail Polish,beauty,Nail Couture,8.99,4.32,11.44

In [4]:
df_carts.head()

,cart_id,products,total,discountedTotal,user_id,totalProducts,totalQuantity
0,1,"[{'id': 168, 'title': 'Charger SXT RWD', 'pric...",103774.85,89686.65,33,4,15
1,2,"[{'id': 144, 'title': 'Cricket Helmet', 'price...",4794.80,4288.95,142,5,20
2,3,"[{'id': 98, 'title': 'Rolex Submariner Watch',...",16775.87,14144.30,108,5,13
3,4,"[{'id': 187, 'title': 'Golden Shoes Woman', 'p...",456.83,443.23,87,4,17
4,5,"[{'id': 108, 'title': 'iPhone 12 Silicone Case...",7431.30,6676.44,134,6,20

In [5]:
df_users.head()

   user_id  age  gender
0        1   29  female
1        2   36    male
2        3   43  female
3        4   46    male
4        5   31  female

In [6]:
df_products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   product_id          30 non-null     int64
 1   product_name        30 non-null     object
 2   category            30 non-null     object
 3   brand               15 non-null     object
 4   price               30 non-null     float64
 5   rating              30 non-null     float64
 6   discountPercentage  30 non-null     float64
dtypes: float64(3), int64(1), object(3)
memory usage: 1.8+ KB

In [7]:
df_products.isnull().sum()

product_id             0
product_name           0
category               0
brand                 15
price                  0
rating                 0
discountPercentage     0
dtype: int64

In [8]:
df_products["brand"] =df_products["brand"].fillna("Unknown")

In [9]:
df_products = df_products.drop_duplicates(subset=["product_id"])

In [10]:
df_products = df_products[
    (df_products["price"] > 0) & (df_products["price"] < 100000)
]

In [11]:
df_users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  30 non-null     int64
 1   age      30 non-null     int64
 2   gender   30 non-null     object
dtypes: int64(2), object(1)
memory usage: 852.0+ bytes

In [12]:
df_users.isnull().sum()

user_id    0
age        0
gender     0
dtype: int64

In [13]:
df_users = df_users.drop_duplicates(subset=["user_id"])

In [14]:
df_users = df_users[
    (df_users["age"] >= 13) & (df_users["age"] <= 100)
]

In [15]:
df_users["gender"] = df_users["gender"].str.lower().str.strip()
df_users["gender"] = df_users["gender"].replace({
    "m": "male",
    "f": "female"
})

In [16]:
df_carts.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   cart_id          30 non-null     int64
 1   products         30 non-null     object
 2   total            30 non-null     float64
 3   discountedTotal  30 non-null     float64
 4   user_id          30 non-null     int64
 5   totalProducts    30 non-null     int64
 6   totalQuantity    30 non-null     int64
dtypes: float64(2), int64(4), object(1)
memory usage: 1.8+ KB

In [17]:
df_carts.isnull().sum()

cart_id            0
products           0
total              0
discountedTotal    0
user_id            0
totalProducts      0
totalQuantity      0
dtype: int64

In [18]:
df_carts = df_carts.drop_duplicates(subset=["cart_id"])

In [19]:
df_carts.columns = df_carts.columns.str.lower()

In [20]:
print(df_products.shape)
print(df_users.shape)
print(df_carts.shape)

df_products.head()

(30, 7)
(30, 3)
(30, 7)

,product_id,product_name,category,brand,price,rating,discountPercentage
0,1,Essence Mascara Lash Princess,beauty,Essence,9.99,2.56,10.48
1,2,Eyeshadow Palette with Mirror,beauty,Glamour Beauty,19.99,2.86,18.19
2,3,Powder Canister,beauty,Velvet Touch,14.99,4.64,9.84
3,4,Red Lipstick,beauty,Chic Cosmetics,12.99,4.36,12.16
4,5,Red Nail Polish,beauty,Nail Couture,8.99,4.32,11.44

In [21]:
df_products.to_csv(
    "C:/Users/User/Desktop/dashboard/PROJECTS_NOT_ON_GITHUB/Retail/data/processed/dim_product.csv",
    index=False
)

df_users.to_csv(
    "C:/Users/User/Desktop/dashboard/PROJECTS_NOT_ON_GITHUB/Retail/data/processed/dim_user.csv",
    index=False
)

df_carts.to_csv(
    "C:/Users/User/Desktop/dashboard/PROJECTS_NOT_ON_GITHUB/Retail/data/processed/carts_clean.csv",
    index=False
)